[{"UID":"1","bio":"Nika Haghtalab is an Assistant Professor in the Department of Electrical Engineering and Computer Sciences at UC Berkeley. She works broadly on the theoretical aspects of machine learning and algorithmic economics. Prof. Haghtalab's work builds theoretical foundations for ensuring both the performance of learning algorithms in presence of everyday economic forces and the integrity of social and economic forces that are born out of the use of machine learning systems. She received her Ph.D. from the Computer Science Department of Carnegie Mellon University, where her thesis won the CMU School of Computer Science Dissertation Award (ACM nomination) and the SIGecom Dissertation Honorable Mention. She is a co-founder of Learning Theory Alliance (LeT-All), a large-scale mentoring and community building initiative for the theory of machine learning community. Among her honors are an Alfred P. Sloan fellowship, an NSF CAREER award, a Schmidt Science AI2050 fellowship, Google research scholars award, NeurIPS and ICAPS best paper awards, an EC exemplary in AI track award, and several industry awards and fellowships.","homepage":"https://people.eecs.berkeley.edu/~nika/","image":"static/images/speakers/nika.jpg","institution":"University of California, Berkeley","session":"session","speaker":"Nika Haghtalab","talk_abstract":"Pervasive needs for robustness, multi-agent collaboration, and fairness have motivated the design of new methods in research and development. However, these methods remain largely stylized, lacking a foundational perspective and provable performance. In this talk, I will introduce and highlight the importance of multi-objective learning as a unifying paradigm for addressing these needs. This paradigm aims to optimize complex and unstructured objectives from only a small amount of sampled data. I will also discuss how the multi-objective learning paradigm relates to the classical and modern considerations in machine learning broadly, introduce technical tools with versatile provable guarantees, and empirical evidence for its performance on a range of important benchmarks.","talk_title":"Multi-objective Learning: A unified framework for robustness, fairness, and collaboration in ML","title":"Assistant Professor","video_url":"https://youtu.be/AzA0w9a9rqk"},{"UID":"2","bio":"Panelist Bios: To be added","homepage":"https://niloufar.org/","image":"static/images/speakers/niloufar.jpg","institution":"A reliable AI startup | UC Berkeley","session":"session","speaker":"Niloufar Salehi","talk_abstract":"Stuart J Russell, Jascha Sohl-Dickstein, and Joaquin Quiñonero Candela will participate in a panel discussion on AI Alignment/Safety research. The discussion will be moderated by Niloufar Salehi","talk_title":"Panel Discussion: AI Alignment/Safety Research","title":"Founder | Assistant Professor","video_url":"https://youtu.be/fU461PQN-D0"},{"UID":"3","bio":"Drago joined Waymo in 2018 to lead the Research team, which focuses on developing the state of the art in autonomous driving using machine learning and has contributed to many of the systems powering the company’s Waymo One service. Drago spent eight years at Google; first working on 3D vision and pose estimation for StreetView, and later leading a research team which developed computer vision systems for annotating Google Photos. The team also invented popular methods such as the Inception neural network architecture and the SSD detector, which helped win the Imagenet 2014 Classification and Detection challenges. Before Waymo, Drago led the 3D Perception team at Zoox.","homepage":"https://www.linkedin.com/in/dragomiranguelov/","image":"static/images/speakers/drago.jpg","institution":"Waymo","session":"session","speaker":"Drago Anguelov","talk_abstract":"Machine learning has proven to be a key ingredient in building a performant and scalable Autonomous Vehicle stack, spanning key capabilities such as perception, behavior prediction, planning and simulation. In this talk, I will describe recent Waymo research on performant ML models and architectures that help us handle the variety and complexity of the real world driving environment, and I will outline key remaining research challenges in our domain.","talk_title":"ML Recipes for Building a Scalable Autonomous Driving Agent","title":"VP and Head of Research","video_url":"https://youtu.be/W7KLcqnno_k"},{"UID":"4","bio":"Richard Socher is the founder and CEO of you.com. Richard previously served as the Chief Scientist and EVP at Salesforce. Before that, Richard was the CEO/CTO of AI startup MetaMind, acquired by Salesforce in 2016. Richard received his Ph.D. in computer science at Stanford. He is widely recognized as having brought neural networks into the field of natural language processing, inventing the most widely used word vectors, contextual vectors and prompt engineering. He has over 190,000 citations and served as an adjunct professor in the computer science department at Stanford.","homepage":"https://www.socher.org/","image":"static/images/speakers/richard.jpg","institution":"You.com","session":"session","speaker":"Richard Socher","talk_abstract":"Richard Socher, CEO and founder of you.com and AIX Ventures, will discuss how building trust in AI is crucial yet often overlooked in the race for LLM advancement. Learn you.com's approach to tackling key challenges: inaccuracies, outdated information, and lack of transparency. Socher will review the technical pillars, including real-time web access, enhanced citation mechanisms, and a model-agnostic compound AI platform. Discover how these solutions improve LLM performance on complex tasks, build user trust, and pave the way for broader AI adoption. Gain insights into evaluating LLM effectiveness, deploying these practices into your own LLM projects, and the future of trustworthy AI. Q&A follows.","talk_title":"Building Trusted AI with LLMs","title":"Founder and CEO","video_url":"https://youtu.be/mvQijqglnfo"}]
