[{"UID":"1","abstract":"","bio":"Jure Leskovec is Associate Professor of Computer Science at Stanford University, Chief Scientist at Pinterest, and investigator at Chan Zuckerberg Biohub. Dr. Leskovec was the co-founder of a machine learning startup Kosei, which was later acquired by Pinterest. His research focuses on machine learning and data mining large social, information, and biological networks. Computation over massive data is at the heart of his research and has applications in computer science, social sciences, marketing, and biomedicine. This research has won several awards including a Lagrange Prize, Microsoft Research Faculty Fellowship, the Alfred P. Sloan Fellowship, and numerous best paper and test of time awards. It has also been featured in popular press outlets such as the New York Times and the Wall Street Journal. Leskovec received his bachelor's degree in computer science from University of Ljubljana, Slovenia, PhD in machine learning from Carnegie Mellon University and postdoctoral training at Cornell University. You can follow him on Twitter at @jure.","homepage":null,"image":"static/images/speakers/jure.jpg","institution":"Stanford University","session":"http://cs.stanford.edu/~jure","speaker":"Jure Leskovec","title":"Keynote # 1"},{"UID":"2","abstract":"","bio":"Sergey Levine received a BS and MS in Computer Science from Stanford University in 2009, and a Ph.D. in Computer Science from Stanford University in 2014. He joined the faculty of the Department of Electrical Engineering and Computer Sciences at UC Berkeley in fall 2016. His work focuses on machine learning for decision making and control, with an emphasis on deep learning and reinforcement learning algorithms. Applications of his work include autonomous robots and vehicles, as well as computer vision and graphics. His research includes developing algorithms for end-to-end training of deep neural network policies that combine perception and control, scalable algorithms for inverse reinforcement learning, deep reinforcement learning algorithms, and more. His work has been featured in many popular press outlets, including the New York Times, the BBC, MIT Technology Review, and Bloomberg Business.","homepage":null,"image":"static/images/speakers/sergey.jpg","institution":"UC Berkeley","session":"https://people.eecs.berkeley.edu/~svlevine/","speaker":"Sergey Levine","title":"Keynote # 2"},{"UID":"3","abstract":"","bio":"Anima Anandkumar is a Bren Professor at Caltech and Director of ML Research at NVIDIA. She was previously a Principal Scientist at Amazon Web Services. She has received several honors such as Alfred. P. Sloan Fellowship, NSF Career Award, Young investigator awards from DoD, and Faculty Fellowships from Microsoft, Google, Facebook, and Adobe. She is part of the World Economic Forum's Expert Network. She is passionate about designing principled AI algorithms and applying them in interdisciplinary applications. Her research focus is on unsupervised AI, optimization, and tensor methods.","homepage":null,"image":"static/images/speakers/anima.jpg","institution":"Caltech, NVidia","session":"","speaker":"Anima Anandkumar","title":"Keynote # 3"},{"UID":"4","abstract":"","bio":"Chief Scientific Officer, Microsoft","homepage":null,"image":"http://erichorvitz.com/Eric_Horvitz_frame_2020.jpg","institution":"Microsoft","session":"http://erichorvitz.com/","speaker":"Eric Horvitz","title":"Keynote # 4"}]
